name: "body"

layer {
  name: "data/body"
  type: "Python"
  top: "data"
  top: "label"
  top: "headbox"
  top: "bodybox"
  top: "legbox"
  top: "rarmbox"
  top: "larmbox"
  top: "rlegbox"
  top: "llegbox"
  python_param {
    module: "roi_data_layer"
    layer: "RoiDataLayer"
    param_str: "{'source': 'external/exp/datalists/jstl_10/train_p.txt', 'root_folder': '', 'batch_size': 60, 'new_height': 96, 'new_width': 96, 'shuffle': True, 'mirror': True, 'mean_value': [103.939,116.779,123.68], 'region_num': 7, 'region_scale': True}"
  }
  include {
    phase: TRAIN
  }
}

layer {
  name: "data/body"
  type: "Python"
  top: "data"
  top: "label"
  top: "headbox"
  top: "bodybox"
  top: "legbox"
  top: "rarmbox"
  top: "larmbox"
  top: "rlegbox"
  top: "llegbox"
  python_param {
    module: "roi_data_layer"
    layer: "RoiDataLayer"
    param_str: "{'source': 'external/exp/datalists/jstl_10/val_p.txt', 'root_folder': '', 'batch_size': 20, 'new_height': 96, 'new_width': 96, 'shuffle': False, 'mirror': False, 'mean_value': [103.939,116.779,123.68], 'region_num': 7, 'region_scale': True}"
  }
  include {
    phase: TEST
  }
}

######################### conv1 #########################

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

######################### conv2 #########################

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  } 
}

layer {
  name: "conv2_bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "conv2_scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

######################### conv3 #########################

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "conv3_bn"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "conv3_scale"
  type: "Scale"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv3"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

######################### inception 1a ##################

layer {
  name: "inception_1a/1x1"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/1x1_bn"
  type: "BatchNorm"
  bottom: "inception_1a/1x1"
  top: "inception_1a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/1x1_scale"
  type: "Scale"
  bottom: "inception_1a/1x1"
  top: "inception_1a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_1x1"
  type: "ReLU"
  bottom: "inception_1a/1x1"
  top: "inception_1a/1x1"
}

layer {
  name: "inception_1a/3x3_reduce"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3_reduce"
}

layer {
  name: "inception_1a/3x3"
  type: "Convolution"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3"
	param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_1a/3x3"
  top: "inception_1a/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/3x3_scale"
  type: "Scale"
  bottom: "inception_1a/3x3"
  top: "inception_1a/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_3x3"
  type: "ReLU"
  bottom: "inception_1a/3x3"
  top: "inception_1a/3x3"
}

layer {
  name: "inception_1a/double_3x3_reduce"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/double_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/double_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_reduce"
}

layer {
  name: "inception_1a/double_3x3_1"
  type: "Convolution"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/double_3x3_1_bn"
  type: "BatchNorm"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/double_3x3_1_scale"
  type: "Scale"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_1"
}

layer {
  name: "inception_1a/double_3x3_2"
  type: "Convolution"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/double_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_1a/double_3x3_2"
  top: "inception_1a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/double_3x3_2_scale"
  type: "Scale"
  bottom: "inception_1a/double_3x3_2"
  top: "inception_1a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_2"
  top: "inception_1a/double_3x3_2"
}

layer {
  name: "inception_1a/pool"
  type: "Pooling"
  bottom: "pool1"
  top: "inception_1a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_1a/pool_proj"
  type: "Convolution"
  bottom: "inception_1a/pool"
  top: "inception_1a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1a/pool_proj_bn"
  type: "BatchNorm"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1a/pool_proj_scale"
  type: "Scale"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/pool_proj"
}

layer {
  name: "inception_1a/output"
  type: "Concat"
  bottom: "inception_1a/1x1"
  bottom: "inception_1a/3x3"
  bottom: "inception_1a/double_3x3_2"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/output"
}

######################### inception_1b #########################

layer {
  name: "inception_1b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_1a/output"
  top: "inception_1b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1b/3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1b/3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3_reduce"
}

layer {
  name: "inception_1b/3x3"
  type: "Convolution"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1b/3x3_bn"
  type: "BatchNorm"
  bottom: "inception_1b/3x3"
  top: "inception_1b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1b/3x3_scale"
  type: "Scale"
  bottom: "inception_1b/3x3"
  top: "inception_1b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1b/relu_3x3"
  type: "ReLU"
  bottom: "inception_1b/3x3"
  top: "inception_1b/3x3"
}

layer {
  name: "inception_1b/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_1a/output"
  top: "inception_1b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1b/double_3x3_reduce_bn"
  type: "BatchNorm"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1b/double_3x3_reduce_scale"
  type: "Scale"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1b/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_reduce"
}

layer {
  name: "inception_1b/double_3x3_1"
  type: "Convolution"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    kernel_size: 1 
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1b/double_3x3_1_bn"
  type: "BatchNorm"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1b/double_3x3_1_scale"
  type: "Scale"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1b/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_1"
}

layer {
  name: "inception_1b/double_3x3_2"
  type: "Convolution"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_1b/double_3x3_2_bn"
  type: "BatchNorm"
  bottom: "inception_1b/double_3x3_2"
  top: "inception_1b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}

layer {
  name: "inception_1b/double_3x3_2_scale"
  type: "Scale"
  bottom: "inception_1b/double_3x3_2"
  top: "inception_1b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_1b/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_2"
  top: "inception_1b/double_3x3_2"
}

layer {
  name: "inception_1b/pool"
  type: "Pooling"
  bottom: "inception_1a/output"
  top: "inception_1b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "inception_1b/output"
  type: "Concat"
  bottom: "inception_1b/3x3"
  bottom: "inception_1b/double_3x3_2"
  bottom: "inception_1b/pool"
  top: "inception_1b/output"
}

layer {
  name: "inception_1b/output/body"
  type: "ROIPooling"
  bottom: "inception_1b/output"
  bottom: "bodybox"
  top: "inception_1b/output/body"
  roi_pooling_param {
    pooled_w: 24
    pooled_h: 24
    spatial_scale: 0.25 #(1/4)
  }
}

######################### inception_2a #########################

layer {
  name: "inception_2a/1x1/body"
  type: "Convolution"
  bottom: "inception_1b/output/body"
  top: "inception_2a/1x1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/1x1_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/1x1/body"
  top: "inception_2a/1x1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/1x1_scale/body"
  type: "Scale"
  bottom: "inception_2a/1x1/body"
  top: "inception_2a/1x1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_1x1/body"
  type: "ReLU"
  bottom: "inception_2a/1x1/body"
  top: "inception_2a/1x1/body"
}

layer {
  name: "inception_2a/3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_1b/output/body"
  top: "inception_2a/3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/3x3_reduce/body"
  top: "inception_2a/3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_2a/3x3_reduce/body"
  top: "inception_2a/3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_2a/3x3_reduce/body"
  top: "inception_2a/3x3_reduce/body"
}

layer {
  name: "inception_2a/3x3/body"
  type: "Convolution"
  bottom: "inception_2a/3x3_reduce/body"
  top: "inception_2a/3x3/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/3x3_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/3x3/body"
  top: "inception_2a/3x3/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/3x3_scale/body"
  type: "Scale"
  bottom: "inception_2a/3x3/body"
  top: "inception_2a/3x3/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_3x3/body"
  type: "ReLU"
  bottom: "inception_2a/3x3/body"
  top: "inception_2a/3x3/body"
}

layer {
  name: "inception_2a/double_3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_1b/output/body"
  top: "inception_2a/double_3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/double_3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/double_3x3_reduce/body"
  top: "inception_2a/double_3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/double_3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_2a/double_3x3_reduce/body"
  top: "inception_2a/double_3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_double_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_reduce/body"
  top: "inception_2a/double_3x3_reduce/body"
}

layer {
  name: "inception_2a/double_3x3_1/body"
  type: "Convolution"
  bottom: "inception_2a/double_3x3_reduce/body"
  top: "inception_2a/double_3x3_1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/double_3x3_1_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/double_3x3_1/body"
  top: "inception_2a/double_3x3_1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/double_3x3_1_scale/body"
  type: "Scale"
  bottom: "inception_2a/double_3x3_1/body"
  top: "inception_2a/double_3x3_1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_double_3x3_1/body"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_1/body"
  top: "inception_2a/double_3x3_1/body"
}

layer {
  name: "inception_2a/double_3x3_2/body"
  type: "Convolution"
  bottom: "inception_2a/double_3x3_1/body"
  top: "inception_2a/double_3x3_2/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/double_3x3_2_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/double_3x3_2/body"
  top: "inception_2a/double_3x3_2/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/double_3x3_2_scale/body"
  type: "Scale"
  bottom: "inception_2a/double_3x3_2/body"
  top: "inception_2a/double_3x3_2/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_double_3x3_2/body"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_2/body"
  top: "inception_2a/double_3x3_2/body"
}

layer {
  name: "inception_2a/pool/body"
  type: "Pooling"
  bottom: "inception_1b/output/body"
  top: "inception_2a/pool/body"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_2a/pool_proj/body"
  type: "Convolution"
  bottom: "inception_2a/pool/body"
  top: "inception_2a/pool_proj/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2a/pool_proj_bn/body"
  type: "BatchNorm"
  bottom: "inception_2a/pool_proj/body"
  top: "inception_2a/pool_proj/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2a/pool_proj_scale/body"
  type: "Scale"
  bottom: "inception_2a/pool_proj/body"
  top: "inception_2a/pool_proj/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2a/relu_pool_proj/body"
  type: "ReLU"
  bottom: "inception_2a/pool_proj/body"
  top: "inception_2a/pool_proj/body"
}

layer {
  name: "inception_2a/output/body"
  type: "Concat"
  bottom: "inception_2a/1x1/body"
  bottom: "inception_2a/3x3/body"
  bottom: "inception_2a/double_3x3_2/body"
  bottom: "inception_2a/pool_proj/body"
  top: "inception_2a/output/body"
}

########################### inception_2b #########################

layer {
  name: "inception_2b/3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_2a/output/body"
  top: "inception_2b/3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2b/3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_2b/3x3_reduce/body"
  top: "inception_2b/3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2b/3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_2b/3x3_reduce/body"
  top: "inception_2b/3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2b/relu_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_2b/3x3_reduce/body"
  top: "inception_2b/3x3_reduce/body"
}

layer {
  name: "inception_2b/3x3/body"
  type: "Convolution"
  bottom: "inception_2b/3x3_reduce/body"
  top: "inception_2b/3x3/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2b/3x3_bn/body"
  type: "BatchNorm"
  bottom: "inception_2b/3x3/body"
  top: "inception_2b/3x3/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2b/3x3_scale/body"
  type: "Scale"
  bottom: "inception_2b/3x3/body"
  top: "inception_2b/3x3/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2b/relu_3x3/body"
  type: "ReLU"
  bottom: "inception_2b/3x3/body"
  top: "inception_2b/3x3/body"
}

layer {
  name: "inception_2b/double_3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_2a/output/body"
  top: "inception_2b/double_3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2b/double_3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_2b/double_3x3_reduce/body"
  top: "inception_2b/double_3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2b/double_3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_2b/double_3x3_reduce/body"
  top: "inception_2b/double_3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2b/relu_double_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_reduce/body"
  top: "inception_2b/double_3x3_reduce/body"
}

layer {
  name: "inception_2b/double_3x3_1/body"
  type: "Convolution"
  bottom: "inception_2b/double_3x3_reduce/body"
  top: "inception_2b/double_3x3_1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2b/double_3x3_1_bn/body"
  type: "BatchNorm"
  bottom: "inception_2b/double_3x3_1/body"
  top: "inception_2b/double_3x3_1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2b/double_3x3_1_scale/body"
  type: "Scale"
  bottom: "inception_2b/double_3x3_1/body"
  top: "inception_2b/double_3x3_1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2b/relu_double_3x3_1/body"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_1/body"
  top: "inception_2b/double_3x3_1/body"
}

layer {
  name: "inception_2b/double_3x3_2/body"
  type: "Convolution"
  bottom: "inception_2b/double_3x3_1/body"
  top: "inception_2b/double_3x3_2/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_2b/double_3x3_2_bn/body"
  type: "BatchNorm"
  bottom: "inception_2b/double_3x3_2/body"
  top: "inception_2b/double_3x3_2/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_2b/double_3x3_2_scale/body"
  type: "Scale"
  bottom: "inception_2b/double_3x3_2/body"
  top: "inception_2b/double_3x3_2/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_2b/relu_double_3x3_2/body"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_2/body"
  top: "inception_2b/double_3x3_2/body"
}

layer {
  name: "inception_2b/pool/body"
  type: "Pooling"
  bottom: "inception_2a/output/body"
  top: "inception_2b/pool/body"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "inception_2b/output/body"
  type: "Concat"
  bottom: "inception_2b/3x3/body"
  bottom: "inception_2b/double_3x3_2/body"
  bottom: "inception_2b/pool/body"
  top: "inception_2b/output/body"
}

######################### inception_3a #########################

layer {
  name: "inception_3a/1x1/body"
  type: "Convolution"
  bottom: "inception_2b/output/body"
  top: "inception_3a/1x1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/1x1_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/1x1/body"
  top: "inception_3a/1x1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/1x1_scale/body"
  type: "Scale"
  bottom: "inception_3a/1x1/body"
  top: "inception_3a/1x1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_1x1/body"
  type: "ReLU"
  bottom: "inception_3a/1x1/body"
  top: "inception_3a/1x1/body"
}

layer {
  name: "inception_3a/3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_2b/output/body"
  top: "inception_3a/3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/3x3_reduce/body"
  top: "inception_3a/3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_3a/3x3_reduce/body"
  top: "inception_3a/3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce/body"
  top: "inception_3a/3x3_reduce/body"
}

layer {
  name: "inception_3a/3x3/body"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce/body"
  top: "inception_3a/3x3/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/3x3_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/3x3/body"
  top: "inception_3a/3x3/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/3x3_scale/body"
  type: "Scale"
  bottom: "inception_3a/3x3/body"
  top: "inception_3a/3x3/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_3x3/body"
  type: "ReLU"
  bottom: "inception_3a/3x3/body"
  top: "inception_3a/3x3/body"
}

layer {
  name: "inception_3a/double_3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_2b/output/body"
  top: "inception_3a/double_3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/double_3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/double_3x3_reduce/body"
  top: "inception_3a/double_3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/double_3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_3a/double_3x3_reduce/body"
  top: "inception_3a/double_3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_double_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_reduce/body"
  top: "inception_3a/double_3x3_reduce/body"
}

layer {
  name: "inception_3a/double_3x3_1/body"
  type: "Convolution"
  bottom: "inception_3a/double_3x3_reduce/body"
  top: "inception_3a/double_3x3_1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/double_3x3_1_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/double_3x3_1/body"
  top: "inception_3a/double_3x3_1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/double_3x3_1_scale/body"
  type: "Scale"
  bottom: "inception_3a/double_3x3_1/body"
  top: "inception_3a/double_3x3_1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_double_3x3_1/body"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_1/body"
  top: "inception_3a/double_3x3_1/body"
}

layer {
  name: "inception_3a/double_3x3_2/body"
  type: "Convolution"
  bottom: "inception_3a/double_3x3_1/body"
  top: "inception_3a/double_3x3_2/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/double_3x3_2_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/double_3x3_2/body"
  top: "inception_3a/double_3x3_2/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/double_3x3_2_scale/body"
  type: "Scale"
  bottom: "inception_3a/double_3x3_2/body"
  top: "inception_3a/double_3x3_2/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_double_3x3_2/body"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_2/body"
  top: "inception_3a/double_3x3_2/body"
}

layer {
  name: "inception_3a/pool/body"
  type: "Pooling"
  bottom: "inception_2b/output/body"
  top: "inception_3a/pool/body"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}

layer {
  name: "inception_3a/pool_proj/body"
  type: "Convolution"
  bottom: "inception_3a/pool/body"
  top: "inception_3a/pool_proj/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3a/pool_proj_bn/body"
  type: "BatchNorm"
  bottom: "inception_3a/pool_proj/body"
  top: "inception_3a/pool_proj/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3a/pool_proj_scale/body"
  type: "Scale"
  bottom: "inception_3a/pool_proj/body"
  top: "inception_3a/pool_proj/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3a/relu_pool_proj/body"
  type: "ReLU"
  bottom: "inception_3a/pool_proj/body"
  top: "inception_3a/pool_proj/body"
}

layer {
  name: "inception_3a/output/body"
  type: "Concat"
  bottom: "inception_3a/1x1/body"
  bottom: "inception_3a/3x3/body"
  bottom: "inception_3a/double_3x3_2/body"
  bottom: "inception_3a/pool_proj/body"
  top: "inception_3a/output/body"
}

######################### inception_3b #########################

layer {
  name: "inception_3b/3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_3a/output/body"
  top: "inception_3b/3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3b/3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_3b/3x3_reduce/body"
  top: "inception_3b/3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3b/3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_3b/3x3_reduce/body"
  top: "inception_3b/3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3b/relu_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce/body"
  top: "inception_3b/3x3_reduce/body"
}

layer {
  name: "inception_3b/3x3/body"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce/body"
  top: "inception_3b/3x3/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3b/3x3_bn/body"
  type: "BatchNorm"
  bottom: "inception_3b/3x3/body"
  top: "inception_3b/3x3/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3b/3x3_scale/body"
  type: "Scale"
  bottom: "inception_3b/3x3/body"
  top: "inception_3b/3x3/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3b/relu_3x3/body"
  type: "ReLU"
  bottom: "inception_3b/3x3/body"
  top: "inception_3b/3x3/body"
}

layer {
  name: "inception_3b/double_3x3_reduce/body"
  type: "Convolution"
  bottom: "inception_3a/output/body"
  top: "inception_3b/double_3x3_reduce/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3b/double_3x3_reduce_bn/body"
  type: "BatchNorm"
  bottom: "inception_3b/double_3x3_reduce/body"
  top: "inception_3b/double_3x3_reduce/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3b/double_3x3_reduce_scale/body"
  type: "Scale"
  bottom: "inception_3b/double_3x3_reduce/body"
  top: "inception_3b/double_3x3_reduce/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3b/relu_double_3x3_reduce/body"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_reduce/body"
  top: "inception_3b/double_3x3_reduce/body"
}

layer {
  name: "inception_3b/double_3x3_1/body"
  type: "Convolution"
  bottom: "inception_3b/double_3x3_reduce/body"
  top: "inception_3b/double_3x3_1/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3b/double_3x3_1_bn/body"
  type: "BatchNorm"
  bottom: "inception_3b/double_3x3_1/body"
  top: "inception_3b/double_3x3_1/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3b/double_3x3_1_scale/body"
  type: "Scale"
  bottom: "inception_3b/double_3x3_1/body"
  top: "inception_3b/double_3x3_1/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3b/relu_double_3x3_1/body"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_1/body"
  top: "inception_3b/double_3x3_1/body"
}

layer {
  name: "inception_3b/double_3x3_2/body"
  type: "Convolution"
  bottom: "inception_3b/double_3x3_1/body"
  top: "inception_3b/double_3x3_2/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
  }
}

layer {
  name: "inception_3b/double_3x3_2_bn/body"
  type: "BatchNorm"
  bottom: "inception_3b/double_3x3_2/body"
  top: "inception_3b/double_3x3_2/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "inception_3b/double_3x3_2_scale/body"
  type: "Scale"
  bottom: "inception_3b/double_3x3_2/body"
  top: "inception_3b/double_3x3_2/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "inception_3b/relu_double_3x3_2/body"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_2/body"
  top: "inception_3b/double_3x3_2/body"
}

layer {
  name: "inception_3b/pool/body"
  type: "Pooling"
  bottom: "inception_3a/output/body"
  top: "inception_3b/pool/body"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "inception_3b/output/body"
  type: "Concat"
  bottom: "inception_3b/3x3/body"
  bottom: "inception_3b/double_3x3_2/body"
  bottom: "inception_3b/pool/body"
  top: "inception_3b/output/body"
}

######################### global pool #########################

layer {
  name: "global_pool/body"
  top: "global_pool/body"
  bottom: "inception_3b/output/body"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_h: 6
    kernel_w: 6
    stride: 1
  }
}

######################### fc #########################

layer {
  name: "fc7/body"
  type: "InnerProduct"
  bottom: "global_pool/body"
  top: "fc7/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "fc7_bn/body"
  type: "BatchNorm"
  bottom: "fc7/body"
  top: "fc7/body"
  batch_norm_param {
    use_global_stats: false
  }
}

layer {
  name: "fc7_scale/body"
  type: "Scale"
  bottom: "fc7/body"
  top: "fc7/body"
  scale_param {
    bias_term: true
  }
}

layer {
  name: "silence"
  type: "Silence"
  bottom: "headbox"
  bottom: "legbox"
  bottom: "rarmbox"
  bottom: "larmbox"
  bottom: "rlegbox"
  bottom: "llegbox"
}

layer {
  name: "relu7/body"
  type: "ReLU"
  bottom: "fc7/body"
  top: "fc7/body"
}

layer {
  name: "drop7/body"
  type: "Dropout"
  bottom: "fc7/body"
  top: "fc7/body"
  dropout_param {
    dropout_ratio: 0.7
  }
}

######################### loss accuracy #########################

layer {
  name: "fc8_jstl/body"
  type: "InnerProduct"
  bottom: "fc7/body"
  top: "fc8_jstl/body"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 16161
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "loss/body"
  type: "SoftmaxWithLoss"
  bottom: "fc8_jstl/body"
  bottom: "label"
  top: "loss"
}

layer {
  name: "accuracy/body"
  type: "Accuracy"
  bottom: "fc8_jstl/body"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}

